# Technical Assessment Test for IHiS

sss

## Data Preparation

In [1]:
import pandas as pd
import numpy as np
import re

In [2]:
#Reading data from Excel Sheet name 'Demographics'
data = pd.read_excel("01_source_files/Technical Test.xls", sheet_name="Demographics")
data.head()

,NRIC,Gender,Age,Marital Status,New NRIC,Coding - Gender,Age Group,Study Number
0,S1510657E,M,39,Divorced,NaN,NaN,NaN,NaN
1,SN5484655,F,68,Single,NaN,NaN,NaN,NaN
2,S7705341S,M,1,Married,NaN,NaN,NaN,NaN
3,SA9787544,M,35,Married,NaN,NaN,NaN,NaN
4,SA7766801,F,91,Married,NaN,NaN,NaN,NaN

In [3]:
data.info()
print('\n')
data.shape

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 117 entries, 0 to 116
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   NRIC             117 non-null    object
 1   Gender           117 non-null    object
 2   Age              117 non-null    int64
 3   Marital Status   117 non-null    object
 4   New NRIC         0 non-null      float64
 5   Coding - Gender  0 non-null      float64
 6   Age Group        0 non-null      float64
 7   Study Number     0 non-null      float64
dtypes: float64(4), int64(1), object(3)
memory usage: 7.4+ KB

(117, 8)

In [4]:
data.duplicated().sum()

5

In [5]:
data.isna().sum()

NRIC                 0
Gender               0
Age                  0
Marital Status       0
New NRIC           117
Coding - Gender    117
Age Group          117
Study Number       117
dtype: int64

## New NRIC

In [6]:
#Noticed some empty space in between, removed them by using .replace()
data['NRIC'] = data.NRIC.str.replace(" ",'')
data.head()

,NRIC,Gender,Age,Marital Status,New NRIC,Coding - Gender,Age Group,Study Number
0,S1510657E,M,39,Divorced,NaN,NaN,NaN,NaN
1,SN5484655,F,68,Single,NaN,NaN,NaN,NaN
2,S7705341S,M,1,Married,NaN,NaN,NaN,NaN
3,SA9787544,M,35,Married,NaN,NaN,NaN,NaN
4,SA7766801,F,91,Married,NaN,NaN,NaN,NaN

In [7]:
# obj = re.compile('[a-z]\d{7}[a-z]', re.IGNORECASE)
# nric = data.NRIC
# # obj.match('S1234567E')
# obj.match(nric)

In [8]:
# def nric_verify (data):

#     for i in data:
#         obj = re.compile('[a-z]\d{7}[a-z]', re.IGNORECASE)
#         obj.match(i)

    # return None

# nric_verify(nric)

In [9]:
nric = pd.DataFrame(data['NRIC'].head(15))
nric

         NRIC
0   S1510657E
1   SN5484655
2   S7705341S
3   SA9787544
4   SA7766801
5   SI9731219
6   S5303187B
7   S5050778Z
8   S8057221N
9   S1964251W
10  X1639705J
11  SR1005774
12  SR7638052
13  SH2467824
14  S9677422V

In [10]:
# query = re.compile('[a-z]\d{7}[a-z]', re.IGNORECASE)

# nric['new_nric'] = nric['NRIC'].str.contains(query)

# nric

## Coding - Gender

In [11]:
#Function to label/code Gender Group

def gender_code(gender_cols):
   if gender_cols == 'F' :
      return 1
   else:
      return 2

In [12]:
#Apply the function with the return values to Gender Group Column
data['Coding - Gender'] = data['Gender'].apply (lambda gender_cols: gender_code(gender_cols))

In [13]:
data

,NRIC,Gender,Age,Marital Status,New NRIC,Coding - Gender,Age Group,Study Number
0,S1510657E,M,39,Divorced,NaN,2,NaN,NaN
1,SN5484655,F,68,Single,NaN,1,NaN,NaN
2,S7705341S,M,1,Married,NaN,2,NaN,NaN
3,SA9787544,M,35,Married,NaN,2,NaN,NaN
4,SA7766801,F,91,Married,NaN,1,NaN,NaN
...,...,...,...,...,...,...,...,...
112,S4596427P,M,84,Single,NaN,2,NaN,NaN
113,ST1966155,F,58,Seperated,NaN,1,NaN,NaN
114,X0960227H,F,72,Single,NaN,1,NaN,NaN
115,SA7766801,F,91,Married,NaN,1,NaN,NaN
116,S1504698Q,M,3,Single,NaN,2,NaN,NaN

In [14]:
np.sort(data['Coding - Gender'].unique())

array([1, 2])

## Age Group

In [15]:
#Function to define and categories Age Group

def age_group(age_cols):
   if age_cols <= 9 :
      return 'G1'
   if age_cols >= 10 and age_cols <= 19:
      return 'G2'
   if age_cols >= 20 and age_cols <= 29:
      return 'G3'
   if age_cols >= 30 and age_cols <= 39:
      return 'G4'  
   if age_cols >= 40 and age_cols <= 49:
      return 'G5'
   if age_cols >= 50 and age_cols <= 59:
      return 'G6'
   if age_cols >= 60 and age_cols <= 69:
      return 'G7'  
   if age_cols >= 70 and age_cols <= 79:
      return 'G8'
   if age_cols >= 80 and age_cols <= 89:
      return 'G9'
   if age_cols >= 90:
      return 'G0'

In [16]:
#Apply the function with the return values to Age Group Column
data['Age Group'] = data['Age'].apply (lambda age_cols: age_group(age_cols))

In [17]:
data

,NRIC,Gender,Age,Marital Status,New NRIC,Coding - Gender,Age Group,Study Number
0,S1510657E,M,39,Divorced,NaN,2,G4,NaN
1,SN5484655,F,68,Single,NaN,1,G7,NaN
2,S7705341S,M,1,Married,NaN,2,G1,NaN
3,SA9787544,M,35,Married,NaN,2,G4,NaN
4,SA7766801,F,91,Married,NaN,1,G0,NaN
...,...,...,...,...,...,...,...,...
112,S4596427P,M,84,Single,NaN,2,G9,NaN
113,ST1966155,F,58,Seperated,NaN,1,G6,NaN
114,X0960227H,F,72,Single,NaN,1,G8,NaN
115,SA7766801,F,91,Married,NaN,1,G0,NaN
116,S1504698Q,M,3,Single,NaN,2,G1,NaN

In [18]:
np.sort(data['Age Group'].unique())

array(['G0', 'G1', 'G2', 'G3', 'G4', 'G5', 'G6', 'G7', 'G8', 'G9'],
      dtype=object)

## Study Number

In [19]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 117 entries, 0 to 116
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   NRIC             117 non-null    object
 1   Gender           117 non-null    object
 2   Age              117 non-null    int64
 3   Marital Status   117 non-null    object
 4   New NRIC         0 non-null      float64
 5   Coding - Gender  117 non-null    int64
 6   Age Group        117 non-null    object
 7   Study Number     0 non-null      float64
dtypes: float64(2), int64(2), object(4)
memory usage: 7.4+ KB

In [20]:
data['Study Number'] = data['Age Group'] + ' - ' + data['Coding - Gender'].astype(str)

In [21]:
data

,NRIC,Gender,Age,Marital Status,New NRIC,Coding - Gender,Age Group,Study Number
0,S1510657E,M,39,Divorced,NaN,2,G4,G4 - 2
1,SN5484655,F,68,Single,NaN,1,G7,G7 - 1
2,S7705341S,M,1,Married,NaN,2,G1,G1 - 2
3,SA9787544,M,35,Married,NaN,2,G4,G4 - 2
4,SA7766801,F,91,Married,NaN,1,G0,G0 - 1
...,...,...,...,...,...,...,...,...
112,S4596427P,M,84,Single,NaN,2,G9,G9 - 2
113,ST1966155,F,58,Seperated,NaN,1,G6,G6 - 1
114,X0960227H,F,72,Single,NaN,1,G8,G8 - 1
115,SA7766801,F,91,Married,NaN,1,G0,G0 - 1
116,S1504698Q,M,3,Single,NaN,2,G1,G1 - 2

## Worksheet: Study Data

### Study Data Worksheet

In [22]:
#Reading data from Excel Sheet name 'Study Data'
study_data =  pd.read_excel("01_source_files/Technical Test.xls", sheet_name="Study Data")
study_data.head()

,Study Number,Old NRIC,New NRIC,Gender,Age,Marital Status,Address 1,Address 2,Contact Number,Ethnic Group
0,NaN,S5050778Z,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,S7133213U,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,SQ3747175,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,SD 1637819,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,S9677422V,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [23]:
study_data.info()
print(study_data.shape)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 87 entries, 0 to 86
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Study Number    0 non-null      float64
 1   Old NRIC        87 non-null     object
 2   New NRIC        0 non-null      float64
 3   Gender          0 non-null      float64
 4   Age             0 non-null      float64
 5   Marital Status  0 non-null      float64
 6   Address 1       0 non-null      float64
 7   Address 2       0 non-null      float64
 8   Contact Number  0 non-null      float64
 9   Ethnic Group    0 non-null      float64
dtypes: float64(9), object(1)
memory usage: 6.9+ KB
(87, 10)

### Extra Information Worksheet

In [24]:
#Reading data from Excel Sheet name 'Extra information'
data_extra =  pd.read_excel("01_source_files/Technical Test.xls", sheet_name="Extra information")
data_extra.head()

         NRIC   Address 1 Address 2  Contact Number Ethnic Group
0   S5050778Z    Tampines    No 944        85694488       Indian
1   S7133213U    Sengkang   Blk 175        98841614        Malay
2   SQ3747175      Yishun    No 362        90466569        Malay
3  SD 1637819  Ang Mo Kio   Blk 471        98780745       Indian
4   S9677422V      Bishan   Blk 272        94541935        Malay

In [25]:
data_extra.info()
print(data_extra.shape)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 87 entries, 0 to 86
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   NRIC            87 non-null     object
 1   Address 1       87 non-null     object
 2   Address 2       87 non-null     object
 3   Contact Number  87 non-null     int64
 4   Ethnic Group    87 non-null     object
dtypes: int64(1), object(4)
memory usage: 3.5+ KB
(87, 5)

### Combination of Worksheets for Study Data

In [26]:
#Merging/combine the data in Demographics worksheet and Extra Information worksheet
demo_n_extra = data.merge(data_extra, how ='left', on='NRIC')

In [27]:
demo_n_extra.head(10)

,NRIC,Gender,Age,Marital Status,New NRIC,Coding - Gender,Age Group,Study Number,Address 1,Address 2,Contact Number,Ethnic Group
0,S1510657E,M,39,Divorced,NaN,2,G4,G4 - 2,Yishun,No 572,95378842.0,Malay
1,SN5484655,F,68,Single,NaN,1,G7,G7 - 1,Bishan,Blk 124,96041021.0,Malay
2,S7705341S,M,1,Married,NaN,2,G1,G1 - 2,Tampines,No 236,92429712.0,Chinese
3,SA9787544,M,35,Married,NaN,2,G4,G4 - 2,NaN,NaN,NaN,NaN
4,SA7766801,F,91,Married,NaN,1,G0,G0 - 1,NaN,NaN,NaN,NaN
5,SI9731219,F,83,Seperated,NaN,1,G9,G9 - 1,NaN,NaN,NaN,NaN
6,S5303187B,F,24,Married,NaN,1,G3,G3 - 1,NaN,NaN,NaN,NaN
7,S5050778Z,F,22,Widowed,NaN,1,G3,G3 - 1,Tampines,No 944,85694488.0,Indian
8,S8057221N,M,73,Married,NaN,2,G8,G8 - 2,Tampines,No 138,87835222.0,Chinese
9,S1964251W,M,79,Married,NaN,2,G8,G8 - 2,Bishan,Blk 852,86784318.0,Malay

In [28]:
demo_n_extra.shape

(117, 12)

In [29]:
data_extra[data_extra['NRIC'] == 'SA9787544']

Empty DataFrame
Columns: [NRIC, Address 1, Address 2, Contact Number, Ethnic Group]
Index: []

In [61]:
demo_n_extra['Ethnic Group'].isna().sum()

45

### Final Combine to Study Data (Not Yet Complete!!)

In [30]:
#Merge or Join data based on columns name

In [31]:
new_data = study_data.merge(data_extra, how ='left', left_on='Old NRIC', right_on='NRIC')

In [32]:
new_data.head(10)

,Study Number,Old NRIC,New NRIC,Gender,Age,Marital Status,Address 1_x,Address 2_x,Contact Number_x,Ethnic Group_x,NRIC,Address 1_y,Address 2_y,Contact Number_y,Ethnic Group_y
0,NaN,S5050778Z,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,S5050778Z,Tampines,No 944,85694488,Indian
1,NaN,S7133213U,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,S7133213U,Sengkang,Blk 175,98841614,Malay
2,NaN,SQ3747175,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,SQ3747175,Yishun,No 362,90466569,Malay
3,NaN,SD 1637819,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,SD 1637819,Ang Mo Kio,Blk 471,98780745,Indian
4,NaN,S9677422V,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,S9677422V,Bishan,Blk 272,94541935,Malay
5,NaN,S2407871W,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,S2407871W,Sengkang,Blk 739,96059744,Malay
6,NaN,S3712911T,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,S3712911T,Yishun,No 809,80219277,Others
7,NaN,S5469475G,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,S5469475G,Bishan,Blk 468,93488491,Malay
8,NaN,X0960227H,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,X0960227H,Ang Mo Kio,Blk 708,98227144,Indian
9,NaN,S2873813S,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,S2873813S,Ang Mo Kio,Blk 712,85647808,Malay

In [33]:
new_data.shape

(87, 15)

## Worksheet: Exception List

### List of unique NRIC

In [154]:
# # Number of Unique NRIC (New Formatted)
# unique_nric = pd.DataFrame(data['NRIC'].value_counts().loc[lambda x : x>1].rename_axis('NRIC').reset_index(name='Counts'))
# unique_nric.index = unique_nric.index + 1

# unique_nric.index.name = 'id'
# unique_nric

         NRIC  Counts
id
1   SZ7623233       2
2   SH2467824       2
3   SP3472533       2
4   S0768833K       2
5   SA7766801       2
6   S2316865C       2
7   S5303187B       2
8   S1964251W       2
9   SR1005774       2
10  S1504698Q       2

## *Change to "New NRIC" later*

In [159]:
# Number of Unique NRIC (New Formatted)
unique_nric = pd.DataFrame(data['NRIC'].value_counts().loc[lambda x : x>1].rename_axis('NRIC').reset_index(name='Counts'))
unique_nric.index = unique_nric.index + 1
unique_nric = unique_nric.rename_axis('S/N').reset_index()

unique_nric

   S/N       NRIC  Counts
0    1  SZ7623233       2
1    2  SH2467824       2
2    3  SP3472533       2
3    4  S0768833K       2
4    5  SA7766801       2
5    6  S2316865C       2
6    7  S5303187B       2
7    8  S1964251W       2
8    9  SR1005774       2
9   10  S1504698Q       2

In [160]:
unique_nric_final = pd.DataFrame(unique_nric[['S/N','NRIC']]).set_index('S/N')
unique_nric_final

          NRIC
S/N
1    SZ7623233
2    SH2467824
3    SP3472533
4    S0768833K
5    SA7766801
6    S2316865C
7    S5303187B
8    S1964251W
9    SR1005774
10   S1504698Q

In [161]:
unique_nric_final.to_excel('02_exported_worksheet/unique_num_nric.xlsx')

In [59]:
#Number of NRIC under Demographics that are found in Extra Information workshee.

nric_notin = data[~data['NRIC'].isin(data_extra['NRIC'])]
nric_notin

,NRIC,Gender,Age,Marital Status,New NRIC,Coding - Gender,Age Group,Study Number
3,SA9787544,M,35,Married,NaN,2,G4,G4 - 2
4,SA7766801,F,91,Married,NaN,1,G0,G0 - 1
5,SI9731219,F,83,Seperated,NaN,1,G9,G9 - 1
6,S5303187B,F,24,Married,NaN,1,G3,G3 - 1
12,SR7638052,F,23,Single,NaN,1,G3,G3 - 1
13,SH2467824,F,21,Seperated,NaN,1,G3,G3 - 1
20,S4157126T,F,99,Widowed,NaN,1,G0,G0 - 1
21,SL5774221,F,72,Single,NaN,1,G8,G8 - 1
23,SY8473437,F,95,Single,NaN,1,G0,G0 - 1
26,SS4240094,M,39,Married,NaN,2,G4,G4 - 2
27,SN6426433,F,43,Married,NaN,1,G5,G5 - 1
30,SR6371473,F,71,Single,NaN,1,G8,G8 - 1
31,S0768839J,F,43,Single,NaN,1,G5,G5 - 1
32,SP6774304,M,61,Seperated,NaN,2,G7,G7 - 2
33,SD1637819,M,18,Seperated,NaN,2,G2,G2 - 2
34,SF2979135,F,98,Married,NaN,1,G0,G0 - 1
37,SO3995938,F,34,Single,NaN,1,G4,G4 - 1
38,SC8351123,F,9,Seperated,NaN,1,G1,G1 - 1
40,S8369416A,M,82,Married,NaN,2,G9,G9 - 2
41,SP4106269,F,25,Seperated,NaN,1,G3,G3 - 1
45,SK3795517,M,57,Married,NaN,2,G6,G6 - 2
48,S0909725X,F,69,Widowed,NaN,1,G7,G7 - 1
53,SU9607889,F,33,Divorced,NaN,1,G4,G4 - 1
54,SZ5050778,F,22,Widowed,NaN,1,G3,G3 - 1
55,XE9282724,M,62,Divorced,NaN,2,G7,G7 - 2
61,SM8620958,M,81,Widowed,NaN,2,G9,G9 - 2
62,SK2898506,M,5,Seperated,NaN,2,G1,G1 - 2
65,SQ7667892,F,66,Single,NaN,1,G7,G7 - 1
66,SG0848434,F,49,Single,NaN,1,G5,G5 - 1
67,SZ7623233,M,31,Widowed,NaN,2,G4,G4 - 2
68,X3540461K,M,44,Widowed,NaN,2,G5,G5 - 2
69,S5303187B,F,24,Married,NaN,1,G3,G3 - 1
75,SI6503803,F,86,Widowed,NaN,1,G9,G9 - 1
77,SV9074411,M,44,Married,NaN,2,G5,G5 - 2
82,SE0201588,F,17,Divorced,NaN,1,G2,G2 - 1
89,SB9775057,F,68,Single,NaN,1,G7,G7 - 1
91,S4008215O,F,89,Single,NaN,1,G9,G9 - 1
95,SZ7634386,F,64,Widowed,NaN,1,G7,G7 - 1
96,SJ0768839,F,43,Single,NaN,1,G5,G5 - 1
98,SZ7623233,M,31,Widowed,NaN,2,G4,G4 - 2
101,SC3320746,F,73,Married,NaN,1,G8,G8 - 1
102,SH2467824,F,21,Seperated,NaN,1,G3,G3 - 1
110,SJ3848263,F,82,Married,NaN,1,G9,G9 - 1
113,ST1966155,F,58,Seperated,NaN,1,G6,G6 - 1
115,SA7766801,F,91,Married,NaN,1,G0,G0 - 1

In [60]:
nric_notin.shape

(45, 8)

## Worksheet: Pivot Table

# !! Additional (Save in diff jupyter file later)

## EDA

In [34]:
# import seaborn as sns

In [35]:
# sns.barplot()